app/Http/Controllers/PrestadaController.php

    public function create()
    {
        $orden = $this->orden();

        return view('peliculas.peliculas',[
            'peliculas' => Pelicula::OrderBy($orden)->get()
        ]);
---
select * from "peliculas" order by "id" asc

    public function reservaUser(){
        $user = Auth::user();

        $alquiladas = Prestada::with('pelicula')->where('user_id' , $user->id);

        return view('peliculas.alquiladas', [
            'prestadas' => $alquiladas->get()
        ]);
---
select * from "peliculas" where "peliculas"."id" in (1, 2, 3)
select * from "prestadas" where "user_id" = 1

    public function store(Pelicula $pelicula)
    {

        abort_unless($pelicula->cantidad > 0, 404);
        $prestada = new Prestada();
        $prestada->user_id = Auth::user()->id;
        $prestada->pelicula_id = $pelicula->id;
        $prestada->created_at = Carbon::now();
        $pelicula->cantidad -= 1;
        $pelicula->save();
        $prestada->save();
---
insert into "prestadas" ("user_id", "pelicula_id", "created_at", "updated_at") values (1, 2, '2022-03-01 12:28:19', '2022-03-01 12:28:19') returning "id"